import android.annotation.SuppressLint
import android.os.Build
import android.os.Bundle
import android.view.GestureDetector
import android.view.LayoutInflater
import android.view.MotionEvent
import android.view.View
import android.view.ViewGroup
import android.widget.ImageView
import android.widget.TextView
import android.widget.Toast
import androidx.annotation.RequiresApi
import com.bumptech.glide.Glide
import androidx.fragment.app.Fragment
import com.example.firstprojectorg2.R

class MyFragment : Fragment() {


    private var contentList = listOf(
        listOf(
            "هنگام سبقت گرفتن اعم از اینکه روز باشد یا شب، برای جلب توجه وسایل نقلیه پشت سر، انجام کدام مورد زیر ضروری است؟",
            "  بوق زدن",
            " تبدیل نور چراغ خودرو",
            "  اشاره با دست",
            "زدن چراغ راهنما",
            "پاسخ صحیح: گزینه شماره 4"
        ),
        listOf(
            "در چه شرایطی میتوان شاسی خودرو را عوض کرد؟",
            " در هیچ شرایطی نمیتوان عوض نمود. ",
            " تعویض آن دل به خواه و بدون اشکال است.",
            " تنها با مجوز راهنمایی و رانندگی میتوان به این کار اقدام نمود.",
            " مجوز کارخانه سازنده برای این کار کافی است.",
            "پاسخ صحیح: گزینه شماره 3"

        ),
        listOf(
            "در چند متری ورودی تونل ها سبقت گرفتن ممنوع است؟",
            " 100 متری",
            " 70 متری",
            " 200 متری",
            " 150 متری",
            "پاسخ صحیح: گزینه شماره4"
        ),
        listOf(
            ": چند متر بعد از تونل و پل ها سبقت آزاد است؟",
            "۵۰ متری",
            " سبقت از انتهای آنها مجاز است",
            " ۱۰۰ متری",
            " ۷۰ متری",
            "پاسخ صحیح: گزینه 3",
        ),
        listOf(
            "در بزرگراه های بیرون شهر،حداکثر سرعت مجاز برای انواع وانت بار چند کیلومتر در ساعت است؟",
            "120",
            "125",
            "110",
            "130",
            "پاسخ صحیح: گزینه 3",
        ),
        listOf(
            " حداکثر میزان سرعت مجاز در بزرگراه های بیرون شهر برای سواری چند کیلومتر در ساعت است؟",
            "110",
            "85",
            "95",
            "125",
            "پاسخ صحیح: گزینه 1",
        ),
        listOf(
            "جمله ی دیر رسیدن بهتر از هرگز نرسیدن است چه مفهومی دارد؟",
            " پرهیز از عجله و شتاب در رانندگی",
            " عدم توجه به قوانین و مقررات",
            "رعایت کردن مقررات مربوط به پارک",
            "با سرعت بالا حرکت کردن",
            "پاسخ صحیح : گزینه 1",
        ),
        listOf(
            "تا چه فاصله ای از تقاطع ها و میادین توقف وسایل نقلیه ممنوع است؟",
            "20",
            "15",
            "25",
            "25",
            "پاسخ صحیح : گزینه 2",
        ),
        listOf(
            "شست وشوی وسایل نقلیه در راهها، ……………",
            " ممنوع است. ",
            " مجاز است.",
            " باعث سد راه و ایجاد خطر و انحراف وسایل نقلیه از مسیر حرکت میشود.",
            "موارد 1 و 3",
            "پاسخ صحیح : گزینه 4",
        ),
        listOf(
            "اگر خودرویی با نور بالا از روبرو به شما نزدیک شود چه کاری انجام می دهید؟",
            "باید با تبدیل نور پایین به نور بالا و بوق ممتد او را متوجه می کنیم.",
            "باید سرعت را افزایش داده و سریع از کنار آن عبور کنیم.",
            "سرعت را کاهش داده و به سمت راست جاده نگاه کنیم کنار چشم حرکت خودرو مقابل را تحت نظر داشته باشیم.",
            "هیچ کدام",
            "پاسخ صحیح : گزینه 3",
        ),
        listOf(
            "حداکثر سرعت در جاده های اصلی برون شهری چند کیلومتر است؟",
            "روزها ۹۵ کیلومتر ، شب ۸۵ کیلومتر",
            " روزها ۱۱۰ کیلومتر ، شب ۹۰ کیلومتر",
            " روزها ۹۰ کیلومتر ، شب ۸۵ کیلومتر",
            " در روزها ۸۰ کیلومتر ؛شب۹۰ کیلومتر",
            "پاسخ صحیح : گزینه 1",
        ),
        listOf(
            "کدام گزینه در خصوص سرعت و حرکت صحیح است؟",
            " سایر کاربران راه به دلیل سرعت بالای وسیله نقلیه شما، زمان واکنش زیادی خواهند داشت.",
            " صدمات و تلفات در تصادفات با سرعت زیاد بسیار بیشتر است.",
            " در سرعت بالا زمان واکنش نسبت به خطرات بسیار افزایش می یابد.",
            " کنترل وسیله نقلیه در سرعت های پایین بسیار سخت است.",
            "پاسخ صحیح : گزینه 2",
        ),
        listOf(
            "وظیفه سیستم تعلیق چیست؟",
            " ممانعت از واژگونی خودرو هنگام گذر از پیچ های تند یا فرمان دادن های تند",
            " حفظ تعادل و پایداری خودرو هنگام عبور از پستی و بلندی ها",
            " تامین راحتی راننده و سرنشینان",
            " همه موارد",
            "پاسخ صحیح : گزینه 4"
        ),
        listOf(
            "مزیت سیستم فرمان هیدررولیک نسبت به سیستم فرمان مکانیکی چیست؟",
            " کار با فرمان مکانیکی راحت تر و چرخش آن آسانتر است.",
            " چرخش فرمان هیدرولیکی آسانتر است.",
            " فرمان هیدرولیکی راحت تر است.",
            " مورد 2 و 3",
            "پاسخ صحیح : گزینه 4"
        ),
        listOf(
            "با مشاهده چراغ قرمز راهنمایی و در صورت نبود خط ایست برای توقف در چند متری چراغ باید توقف کنیم؟",
            " 15 متری",
            " 20 متری",
            " بیش از 15 متر",
            " 5 متری",
            "پاسخ صحیح : گزینه 4"
        ),
        listOf(
            "علائم خستگی در رانندگی چیست؟",
            " کم شدن توجه به رانندگی و کاهش سرعت تصمیم گیری",
            " رانندگی ایمن و رعایت سرعت مجاز",
            " نشاط و پر انرژی بودن در رانندگی",
            " راندن خودرو با سرعت مطمئنه و رعایت قوانین و مقررات",
            "پاسخ صحیح : گزینه 1"
        ),
        listOf(
            "رانندگان وسیله نقلیه موظفند برای رویت کلیه اشیا و اشخاص در جاده ها از چراغ … استفاده نمایند؟",
            " نور بالا",
            " چراغ های جانبی عقب",
            " چراغ های جانبی جلو",
            " نور پایین",
            "پاسخ صحیح : گزینه 1"
        ),
        listOf(
            "مهم ترین نکته ای که در خرید خودرو باید در نظر داشت چیست؟\n",
            " تجهیزات رفاهی",
            " زیبایی ظاهری",
            " سطح ایمنی",
            " نوع خودرو",
            "پاسخ صحیح : گزینه 3"
        ),
        listOf(
            "کدام جمله درباره کیسه هوا صحیح نمی باشد؟",
            " تکنولوژی های پیرفته در زمینه ایمنی خودرو ، کیسه هوا یا ایربگ می باشد.",
            " با وجود کیسه هوا دیگر نیازی به کمربند ایمنی نمی باشد.",
            " کیسه هوا ، هنگام تشخیص ضربه ناشی از تصادف در کسری از ثانیه باز می شود.",
            " فعال شدن کیسه هوا در حالتی که کمربند ایمنی بسته نشده باشد ، نتایج مخرب تری خواهد داشت.",
            "پاسخ صحیح : گزینه 2"
        ),
        listOf(
            "باز گذاشتن در صندوق عقب وسایل نقلیه در حال حرکت …",
            " ممنوع است.",
            " مجاز است.",
            "در صورت رعایت سایر شرایط مجاز است",
            " در صورت داشتن بار مجاز است.",
            "پاسخ صحیح : گزینه 1"
        ),
        listOf(
            "تعویض وایر شمع ها هر از چه مدت باید انجام داد؟",
            " هر 7000 کیلومتر",
            " هر 9000 کیلومتر",
            " هر 60000 کیلومتر",
            " هر 10000 کیلومتر",
            "پاسخ صحیح : گزینه 4"
        ),
        listOf(
            "در امن کردن محل حادثه کدام مورد صحیح نمی باشد؟",
            " دور کردن مصدوم از محل حادثه",
            " مراقبت از سلامت خود",
            " نجات دادن جان مصدوم گیر افتاده در آتش",
            " خاموش کردن وسیله نقلیه حادثه ساز",
            "پاسخ صحیح : گزینه 3"
        ),
        listOf(
            "برای انجام کمک های اولیه اگر آرامش ندارید چه باید بکنید؟",
            " کشیدن چند نفس عمیق و آرام به شما کمک می کند تا آرامش خود را بدست آورده و به شرایط محیط تسلط یابید.",
            " به مصدوم بگویید در حال حاضر آرامش ندارید و نمی توانید برای او کاری انجام دهید.",
            " باید هر چه سریعتر صحنه را ترک نمایید و از محل حادثه دور شوید.",
            " باید سریعاً ارائه کمک های اولیه را به اتمام برسانید.",
            "پاسخ صحیح : گزینه 1",
        ),
        listOf(
            " بازدید سطح روغن ترمز هر از چه مدت باید انجام شود؟",
            " هر ماه",
            " روزی یکبار",
            " هفته ای یکبار",
            " دو هفته یکبار",
            "پاسخ صحیح : گزینه 3",
        ),
        listOf(
            "محل قرارگیری تایر ها در خودرو باید در هر چند کیلومتر پیمایش تعویض گردد؟",
            " هر 20 هزار کیلومتر",
            " هر 5 هزار کیلومتر",
            " هر 15 هزار کیلومتر",
            " هر 15 هزار کیلومتر",
            "پاسخ صحیح : گزینه2",
        ),
        listOf(
            "حداکثر سرعت در بزرگراه های درون شهر چند کیلومتر می باشد ؟",
            " 120",
            " 100",
            " 70",
            " 90",
            "پاسخ صحیح : گزینه2"
        ),
        listOf(
            "خط مقطع بیانگر چیست؟",
            " رانندگان وسایل نقلیه حق دور زدن و سبقت را دارند.",
            " رانندگان وسایل نقلیه نباید به هیچ وجه از روی آن عبور نمایند.",
            " رانندگان وسایل نقلیه حق دور زدن ندارند.",
            " رانندگان وسایل نقلیه حق سبقت دارند.",
            "پاسخ صحیح : گزینه1"
        ),
        listOf(
            "بر اساس آیین نامه راهنمایی و رانندگی ، ایستادن ممنوع … است؟",
            " توقف مطلقاً ممنوع",
            " توقف",
            " ایست وسیله نقلیه در زمان کوتاه",
            " توقف ممنوع",
            "پاسخ صحیح : گزینه1"
        ),
        listOf(
            "در چه حالتی سبقت از سمت راست انجام می گیرد؟",
            " سبقت از سمت راست ممنوع می باید",
            " در صورتی که وسیله دیگر به سمت چپ گردش کند",
            " سبقت از سمت چپ فقط مجاز است",
            " زمانیکه سمت چپ بسته باشد",
            "پاسخ صحیح : گزینه2"
        ),
        listOf(
            "مفهوم رنگ قرمز در علائم عبور و مرور چیست",
            " حرکت مجاز",
            " راهنما برای مناطق تفریحی و فرهنگی",
            " منع کننده یا ایست",
            " راهنمایی برای مناطق اداری و آموزشی",
            "پاسخ صحیح : گزینه3"
        ),
        listOf(
            "اگر خودرویی با نور بالا از روبرو به شما نزدیک شود چه باید بکنید؟",
            " باید سرعت را افزایش داده و سریع از کنار آن عبور کرد",
            " سرعت را کاهش داده و به سمت راست جاده نگاه کرده و با کنار چشم حرکت خودرو مقابل را تحت نظر داشت",
            " باید سرعت را کاهش داده و به سمت جاده نگاه کرد",
            " باید با تبدیل نور پایین به نور بالا و بوق ممتد او را متوجه نمود که از نور پایین استفاده کند",
            "پاسخ صحیح : گزینه2"
        ),
        listOf(
            "کدامیک از موارد زیر جز سیستم خنک کاری موتور نمی باشد؟",
            " فن",
            " ترموستات",
            " رادیاتور",
            " میل لنگ",
            "پاسخ صحیح : گزینه 4"
        ),
        listOf(
            "کدام مورد جزو آلاینده های هوا نمی باشد؟",
            " اکسیژن",
            " گاز نیتروژن",
            " ذرات معلق",
            " دی اکسید کربن",
            "پاسخ صحیح : گزینه1"
        ),
        listOf(
            "بازدید آب رادیاتور هر از چه مدت باید انجام شود؟",
            "هرماه",
            " هر دو هفته یکبار",
            " روزی یکبار",
            " هفته ای یکبار",
            "پاسخ صحیح : گزینه 4"
        ),
        listOf(
            "سرعت مجاز برای خودروها در جاده های اصلی در روز حداکثر … و شب ها حداکثر … کیلومتر در ساعت است؟",
            " 95 - 85",
            " 90 - 100",
            " 110 - 100",
            " 100 - 110",
            "پاسخ صحیح : گزینه1",
        ),
        listOf(
            "پر باد بودن تایر خودرو می تواند باعث بروز کدامیک از موار زیر شود؟",
            " باعث فرسایش تایر در سرعت های بالا 50 کیلومتر در ساعت خواهد بود",
            " فرمان پذیری خودرو را کاهش داده و باعث ایجاد خطر می گردد",
            " باعث افزایش مصرف سوخت در سرعت های زیر 50 کیلومتر در ساعت می شود",
            " بات سر خوردن لاستیک در حین ترمز در سرعت های ریز 50 کیلومتر در ساعت می شود",
            "پاسخ صحیح : گزینه2"
        ),
        listOf(
            "… علاوه بر اینکه کلیدی ترین ابزار در کنترل خودرو می باشد ، می تواند به عنوان بازخوردی مناسب ، صحت یا عدم سلامت بخش های مهمی از خودرو همچون سیستم جلوبندی و وضعیت فرمان پذیری را آشکار می کند.",
            " پدال ترمز",
            " پدال کلاچ",
            " پدال گاز",
            " غربیلک فرمان",
            "پاسخ صحیح : گزینه 4"
        ),
        listOf(
            "سبقت از طرف راست وسیله نقلیه ای در حال گردش به چپ می باشد …؟",
            " در هنگام روز مجاز است",
            " فقط در معابر شریانی درجه دو ممنوع است",
            " ممنوع است",
            " مجاز است",
            "پاسخ صحیح : گزینه 4"
        ),
        listOf(
            "در شرایطی که موتور جوش بیاورد چه اقدامی باشد انجام داد؟",
            " مقداری آب روی رادیاتور می ریزیم",
            " موتور را نباید خاموش کرد",
            " درب رادیاتور را باز نمی کنیم",
            " همه موارد",
            "پاسخ صحیح : گزینه 4"
        ),
        listOf(
            "در برخورد راه اصلی با راه فرعی تقدم عبور با وسیله ای است که …",
            " به سمت راست گردش می کند",
            " از راه فرعی عبور می کند",
            " از راه اصلی عبور می کند",
            " در طرف راست وسیله نقلیه دیگر قرار دارد",
            "پاسخ صحیح : گزینه3"
        ),
        listOf(
            "کدام مورد از انواع آلودگی سهم زیادی از آلودگی ترافیک شهری را تشکیل می دهد؟",
            " آلودگی هوا ناشی از وسایل نقلیه موتوری",
            " آلودگی هوا ناشی از منابع خانگی",
            " آلودگی شنیداری",
            " آلودگی هوا ناشی از کارخانجات",
            "پاسخ صحیح : گزینه1",
        ),
        listOf(
            "کاربرد چراغ جانبی جلو چیست؟",
            " حضور وسیله نقلیه و طول آن را نشان می دهد",
            " حضور وسیله نقلیه و عرض آن را از سمت عقب نشان می دهد",
            " حضور وسیله نقلیه جلو را نشان می دهد",
            " حضور وسیله نقلیه و عرض آن را از سمت جلو نشان می دهد",
            "پاسخ صحیح : گزینه 4"
        ),
        listOf(
            "تنظیم صندلی برای چیست؟",
            " 1- تسلط به فرمان- پدال های ترمز،گاز و کلاچ و دنده",
            "- میدان دید طبیعی",
            "- گزینه 1و2",
            "  هیچکدام",
            "پاسخ صحیح : گزینه3"
        ),
        listOf(
            "در چه فاصله از ورودی یا خروجی مراکز آتش نشانی ،پلیس و بیمارستان ها توقف ممنوع است؟",
            "10",
            "20",
            "15",
            "30",
            "پاسخ صحیح : گزینه2"
        ),
        listOf(
            "رانندگان با چراغ قرمز چشمک زن در تقاطع ها باید چه عملی انجام دهند؟",
            " قبل از ورود به تقاطع یا گذرگاه عابر پیاده توقف ، پس از اطمینان از عدم وجود خطر تصادف عبور کنند",
            " عبور آزاد است ولی باید با سرعت کم از تقاطع عبور کنند",
            " با سرعت بالا و بی درنگ از تقاطع عبور نمایند",
            " از سرعت خود کاسته و با احتیاط عبور کنند",
            "پاسخ صحیح : گزینه1"
        ),
        listOf(
            "در خیابان ها و جاده هایی که نور کافی وجود دارد …",
            " تمام چراغ ها را باید خاموش نمود",
            " باید تنها از نور پایین استفاده کرد",
            " باید تنها از چراغ های جانبی جلو و عقب استفاده کرد",
            " باید از نور بالا استفاده کرد",
            "پاسخ صحیح : گزینه3"
        ),
        listOf(
            "مسافتی که از زمان ترمز تا زمان توقف طی می شود … نام دارد؟",
            " مسافت توقف",
            " زمان واکنش",
            " زمان توقف",
            " مسافت ترمز",
            "پاسخ صحیح : گزینه4"
        ),
        listOf(
            "کدامیک از موارد زیر وظیفه قطع و وصل کردن مدار آب از موتور به رادیاتور را به عهده دارد؟",
            " واتر پمپ",
            " ترموستات",
            " رادیاتور",
            " پروانه",
            "پاسخ صحیح : گزینه2"
        ),
        listOf(
            "بر اساس آیین نامه راهنمایی و رانندگی منظور از ایست وسیله نقلیه در زمان کوتاه کدام است؟",
            " ایستادن",
            " ایست وسیله نقلیه در زمان طولانی",
            " ایستادن ممنوع",
            " ایست وسیله نقلیه برای هر مدت ممنوع",
            "پاسخ صحیح : گزینه1"
        ),
        listOf(
            "کم بودن عمق شیار تایر منجر به چه اتفاقی می شود؟",
            " افزایش احتمال آسیب به تایر",
            " سر خوردن خودرو به ویژه در سطوح خیس یا مرطوب",
            " کاهش مقدار اصطکاک میان تایر و سطح راه",
            " تمام موارد",
            "پاسخ صحیح : گزینه4"
        ),
        listOf(
            "استفاده از ترمز دستی در سرعت های بالا چه خطری را به وجود می آورد؟",
            " در موارد ضروری نیاز است",
            " از دست رفتن پایداری خودرو و فراهم شدن شرایط واژگونی خودرو",
            " به شدت سرعتش کاسته می شود",
            " مسافت توقف کاهش می یابد",
            "پاسخ صحیح : گزینه2"
        ),
        listOf(
            "با کسانی که در صورت ضبط گواهی نامه مبادرت به رانندگی می نمایند چه بر خوردی می شود ؟",
            " در صورتی که مرتکب خلاف نشود مشمول مجازات نخواهد شد.",
            " تا پایان عمر به آنها گواهی نامه داده نمی شود.",
            " به مراجع قضایی معرفی و به مجازات مقرر برای رانندگان بدون گواهی نامه محکوم می شوند.",
            " باید هرچه سریع تر خود را به مراجع قضایی معرفی نمایند.",
            "پاسخ صحیح : گزینه3"
        ),
        listOf(
            "در راه های کوهستانی و مشابه آن که عبور دو وسیله از کنار هم غیر ممکن باشد حق تقدم با وسیله ای است … ؟",
            " با وسیله ای که سرازیری می رود.",
            " با وسیله ای که سربالایی می رود.",
            " وسیله ای که سربالایی میرود باید دنده عقب بگیرد.",
            " با وسیله ای که سمت پرتگاه قرار دارد.",
            "پاسخ صحیح : گزینه2"
        ),
        listOf(
            "تابلو های بازدارنده را تابلوهای …..نیز میگویند که بیشتر به شکل…..با نوار حاشیه……رنگ هستند؟",
            "انتظامی -مثلث- قرمز",
            "هشدار دهنده -دایره-قرمز",
            "انتظامی-دایره-قرمز",
            "هشدار دهنده- مثلث- آبی",
            "پاسخ صحیح : گزینه3"
        ),
        listOf(
            "دور زدن از چند متری پیچ ها ممنوع است؟",
            " 250 متری",
            " 150 متری",
            " 500 متری",
            " 300 متری",
            "پاسخ صحیح : گزینه2"
        ),
        listOf(
            "به چه دلیل حرکت با دنده عقب خطرناک است؟",
            " راننده نمی تواند پشت سر خود را به درستی و کامل ببیند.",
            " خودرو صرفاً برای حرکت رو به جلو طراحی شده است.",
            " دنده ها در حرکت رو به عقب آسیب می بینند.",
            " به طور کلی حرکت با دنده عقب ممنوع است.",
            "پاسخ صحیح : گزینه1"
        ),
        listOf(
            "در سه راهه ها حق تقدم عبور با وسیله ای است که …",
            " به سمت گردش می کند.",
            " در طرف راست وسیله ی نقلیه قرار دارد.",
            " به سمت چپ در حال گردش است.",
            " به طور مستقیم و در مسیر مجاز حرکت می کند.",
            "پاسخ صحیح : گزینه4"
        ),
        listOf(
            " ایستادن یا توقف وسایل نقلیه در کدام یک از محل های زیر ممنوع است؟",
            " از ابتدا تا انتهای پیچ ها",
            " در فاصله 15 متری میدان یا تقاطع یا سه راه ها یا تقاطع راه آهن",
            " پیاده رو و گذرگاه پیاده",
            " تمام موارد",
            "پاسخ صحیح : گزینه4"
        ),
        listOf(
            "محدودیت های حرکت و سرعت در جاده ها به وسیله … تعیین می گردد.",
            " علائم و تابلو ها",
            " افراد صلاحیت دار",
            " رانندگان",
            " استفاده کنندگان از راه",
            "پاسخ صحیح : گزینه1"
        ),
        listOf(
            "هنگام رانندگی و مشاهده چراغ چشمک زن قرمز چه اقدامی باید انجام داد؟",
            " عبور از تقاطع با همان سرعت و احتیاط لازم",
            " ایست و عبور",
            " عبور از تقاطع با سرعت کم و احتیاط لازم",
            " عبور با احتیاط",
            "پاسخ صحیح : گزینه2"
        ),
        listOf(
            "در کدامیک از موارد زیر باید نور بالا را به نور پایین تبدیل نماییم؟",
            " زمانی که فاصله شما با خورویی که در جلوی شما حرکت می کند 150 متر یا بیشتر باشد.",
            " زمانی که فاصله شما با خودرویی که در جلوی شما حرکت می کند 200 متر یا کمتر باشد.",
            " نیازی به تغییر نور بالا به نور پایین به جز در جاده های پر رفت و آمد نیست.",
            " زمانی که فاصله شما با خودرویی که از مقابل به شما نزدیک می شود 150 متر یا کمتر باشد.",
            "پاسخ صحیح : گزینه4"
        ),
        listOf(
            "از چند متری پیچ ها سبقت گرفتن ممنوع است؟",
            " 30 متری",
            " 50 متری",
            " 40 متری",
            " سبقت گرفتن محدودیت ندارد.",
            "پاسخ صحیح : گزینه2"
        ),
        listOf(
            "چند متر بعد از تونل ها و پل ها سبقت گرفتن آزاد است؟",
            " 100 متری",
            " 70 متری",
            " 50 متری",
            " سبقت از انتهای آنها مجاز است.",
            "پاسخ صحیح : گزینه1"
        ),
        listOf(
            "راننده ای که دست چپ را به طور افقی نگه دارد به چه معناست؟",
            " توقف",
            " افزایش سرعت",
            " گردش یا تغییر مسیر به چپ",
            " گردش یا تغییر مسیر به راست",
            "پاسخ صحیح : گزینه3"
        ),
        listOf(
            "دور زدن از چند متری پیچ ها ممنوع است؟",
            " 150 متری",
            " 200 متری",
            " 250 متری",
            " 500 متری",
            "پاسخ صحیح : گزینه1"
        ),
        listOf(
            "مفهوم چراغ سبز راهنمایی چیست؟",
            " افزایش سرعت وسیله نقلیه و عبور سریع از تقاطع",
            " توقف پشت تابلو ایست در تقاطع",
            " عبور یا گردش آزاد است مگر آنکه گردش نمودن توسط علائم دیگر ممنوع شده است.",
            " ایست کامل و سپس عبور",
            "پاسخ صحیح : گزینه3"
        ),
        listOf(
            "حداقل سرعت در آزاد راه های درون شهری چند کیلومتر در ساعت است؟",
            " 30 کیلومتر در ساعت",
            " 50 کیلومتر در ساعت",
            " 60 کیلومتر در ساعت",
            " 70 کیلومتر در ساعت",
            "پاسخ صحیح : گزینه4"
        ),
        listOf(
            "از کدام علامت آگاه سازی برای سبقت گرفتن در روز استفاده می شود؟",
            " بوق کوتاه و چراغ راهنما",
            " افزایش سرعت و تبدیل متناوب نور",
            " اشاره با دست به همراه بوق متناوب",
            " تعویض نور چراغ بالا و پایین",
            "پاسخ صحیح : گزینه1"
        ),
        listOf(
            "در صورتیکه در وسط تقاطع چراغ راهنمایی زرد شود …",
            " در همان محل توقف نموده و اجازه عبور را به سایرین بدهید.",
            " با احتیاط کامل و سرعت کم عبور نمایید.",
            " توقف نموده و بلافاصله گردش به چپ نمایید.",
            " توقف نموده و با دنده عقب به پشت چراغ راهنمایی برگردید.",
            "پاسخ صحیح : گزینه2"
        ),
        listOf(
            "تحت چه شرایطی می توان در تقاطع ها سبقت گرفت؟",
            " سبقت در تقاطع ها ممنوع است.",
            " اگر تقاطع خلوت باشد.",
            " اگر مسیر یک طرفه باشد.",
            " اگر چراغ تقاطع چشمک زن باشد.",
            "پاسخ صحیح : گزینه1"
        ),
        listOf(
            "از چند متری تقاطع راه آهن سبقت گرفتن ممنوع است؟",
            " 150 متری",
            " 100 متری",
            " 50 متری",
            " محدودیت ندارد.",
            "پاسخ صحیح : گزینه3"
        ),
        listOf(
            "به چه دلیل سبقت گرفتن از کامیون طویل (کشنده یا یدک ) خطرناک تر از سبقت گرفتن از یک اتومبیل معمولی است؟",
            " کامیون ها نسبت به اتومبیل ها طویل ترند و برای سبقت از آن ها به مسافت و زمان بیشتری نیاز است.",
            " کامیون ها با سرعت کمتری از تپه بالا می روند.",
            " کامیون ها ممکن است ناگهان کنار کشیده و توقف کنند.",
            " ترمز کامیون ها به خوبی ترمز اتومبیل های دیگر نیست.",
            "پاسخ صحیح : گزینه1"
        ),
        listOf(
            "در مبحث مفهوم رنگ ها و علائم عبور و مرور ، مفهوم رنگ قهوه ای کدام است؟",
            " علائم دستوری",
            " راهنمای مناطق تفریحی و گردشگری و فرهنگی",
            " راهنمای خدمات",
            " راهنمای مسیر در سایر راه ها",
            "پاسخ صحیح : گزینه2"
        ),
        listOf(
            "برای تغییر مسیر به سمت راست اگر وسیله نقلیه موتوری چراغ راهنما نداشته باشد باید … ؟",
            " دست چپ را به طرف پایین نگه دارید.",
            " دست راست را به طرف بالا نگه دارند.",
            " دست چپ را به طور افقی نگه دارند.",
            " دست چپ را به طرف بالا نگه دارند.",
            "پاسخ صحیح : گزینه4"
        ),
        listOf(
            "در کدامیک از موارد زیر دور کردن خود و دیگران از صحنه تصادف از اهمیت بیشتری نسبت به سایر موارد برخوردار است؟",
            " در حوادثی که خطراتی نظیر جاری شدن مواد خطرناک یا گازهای سمی وجود دارد.",
            " در حوادثی که تعداد مصدومین کم باشد.",
            " در مواردی که خودرو در کنار راه قرار نداشته باشد.",
            " در تصادف خودرو های عمومی که امداد رسانی کلیه افراد ممکن نم باشد.",
            "پاسخ صحیح : گزینه1"
        ),
        listOf(
            "موثر ترین عضو بدن در رانندگی چیست؟",
            " پاها",
            " قلب",
            " چشم ها",
            " دست ها",
            "پاسخ صحیح : گزینه3"
        ),
        listOf(
            "مقدار ولتاژ باتری در خودروهای معمول سواری چند ولت است؟",
            " 12 ولت",
            " 24 ولت",
            " 6 ولت",
            " 3 ولت",
            "پاسخ صحیح : گزینه1"
        ),
        listOf(
            "ایستادن یا توقف وسایل نقلیه در کدام یک از محل های زیر ممنوع است؟",
            " 15 متری ورودی بیمارستان ها",
            " در فاصله 50 متری میدان یا تقاطع یا سه راه ها یا تقاطع راه آهن",
            " از 100 متری ابتدا تا انتهای پیچ ها",
            " از 50 متری شیر های آتش نشانی",
            "پاسخ صحیح : گزینه1"
        ),
        listOf(
            "معنی و مفهوم استفاده از نور بالا چیست؟",
            "جهت اینکه حق تقدم با شماست.",
            "جهت اعلام اینکه به آنها راه داده اید.",
            "-جهت اعلام حضور به آنها",
            "جهت اعلام بسته بودن مسیر",
            "پاسخ صحیح : گزینه3"
        ),
        listOf(
            "چگونه می توان نقطه کور وسیله نقلیه را کاهش داد؟",
            " کم کردن سرعت خود",
            " حذف آینه وسط",
            " کاهش ارتفاع خودرو با دستکاری کمک های آن",
            " با تنظیم دقیق آینه ها",
            "پاسخ صحیح : گزینه4"
        ),
        listOf(
            "در موتور خودروها برای تصفیه روغن از چه وسیله ای استفاده می شود؟",
            " فیلتر روغن",
            " پمپ روغن",
            " مخزن روغن",
            " صافی بنزین",
            "پاسخ صحیح : گزینه1"
        ),
        listOf(
            "کدام از یک از وسایل نقلیه زیر نسبت به دیگر وسایل نقلیه از امنیت کمتری برخوردارند ؟",
            " وسایل نقلیه کشاورزی",
            " موتورسیکلت ها و دوچرخه ها",
            " کامیون ها و اتوبوس ها",
            " خودروهای سواری",
            "پاسخ صحیح : گزینه2"
        ),
        listOf(
            "منظور از طراحی خط ایست در ورودی تقاطع کدام است؟",
            " مرز توقف وسایل نقلیه",
            " حرکت عابران پیاده بر روی خط مورد نظر",
            " اغلام خطر به کاربران ترافیک",
            " رویت شبکه معابر هنگام تاریکی",
            "پاسخ صحیح : گزینه1"
        ),
        listOf(
            "حداکثر سرعت در خیابان های شریانی اصلی … کیلومتر در ساعت و در خیابان های شریانی فرعی … کیلومتر در ساعت و در معبر محلی و میدان ها … کیلومتر در ساعت است؟",
            " 50 - 60 - 20",
            " 60 - 50 - 30",
            " 50 - 60 - 30",
            " 60 - 50 - 20",
            "پاسخ صحیح : گزینه3"
        ),
        listOf(
            "تاثیرات مواد مخدر چیست؟",
            " اعتماد به نفس کاذب - کاهش هوشیاری",
            " عدم کنترل راننده در شرایط ضروری",
            " اعتنا نکردن به قوانین رانندگی و فرامین پلیس",
            " عدم رعایت شئونات و بر هم زدن نظم رانندگی",
            "پاسخ صحیح : گزینه1"
        ),
        listOf(
            "به همراه چراغ چشمک زن قرمز معمولاً کدام تابلوی راهنمایی و رانندگی نصب می گردد؟",
            " گردش به چپ ممنوع",
            " ایست و یا رعایت حق تقدم",
            " فقط عبور مستقیم مجاز",
            " فقط عبور به راست مجاز",
            "پاسخ صحیح : گزینه2"
        ),
        listOf(
            "مفهوم رنگ سیاه و سفید در علائم عبور و مرور چیست ؟",
            " اخباری و گردشگری",
            " راهنمای اماکن مذهبی",
            " دستوری و راهنمای مسیر در راه ها",
            " هیچکدام",
            "پاسخ صحیح : گزینه3"

        ),
        listOf(
            "نام دیگر ترمز دستی چیست؟",
            " ترمز توقف",
            " ترمز پارک",
            " ترمز ثانویه",
            " مواد 1 و 2",
            "پاسخ صحیح : گزینه3"
        ),
        listOf(
            "مفهوم شکل هشت گوشه مقابل در علائم عبور و مرور چیست؟",
            " شروع و پایان حق تقدم مسیر",
            " علامت دستوری بازدارنده",
            " تنها برای تابلوهای ایست (توقف)",
            " صرفاً برای رعایت حق تقدم",
            "پاسخ صحیح : گزینه3"
        ),
        listOf(
            "مهم ترین وظیفه سیستم روغنکاری در خودرو کدام است؟",
            " روانکاری و خنک کاری قطعات",
            " رساندن سوخت به موتور",
            " کمک به خروج دود از اگزوز",
            " حفظ تعادل و پایداری موتور",
            "پاسخ صحیح : گزینه1"
        ),
        listOf(
            "در صورت خراب شدن ماشین در بزرگ راه تابلو اعلان خطر را در چند متری قرار می دهیم؟",
            " 70 متری",
            " 100 متری",
            " 150 متری",
            " 200 متری",
            "پاسخ صحیح : گزینه1"
        ),
        listOf(
            "ایستادن یا توقف وسایل نقلیه در کدام یک از محل های زیر ممنوع است؟",
            " از 50 متری ورودی مراکز آتش نشانی",
            " از 50 متری ورودی مراکز فوریت های پزشکی",
            " در فاصله 20 متری میدان یا تقاطع یا سه راه ه یا تقاطع راه آهن",
            " پیاده رو و گذرگاه پیاده",
            "پاسخ صحیح : گزینه4"
        ),
        listOf(
            "در آزاد راه های درون شهری و مناطق غیر مسکونی ، حداقل سرعت چند کیلومتر در ساعت است؟",
            " 70",
            " 65",
            " 60",
            " 50",
            "پاسخ صحیح : گزینه1"
        ),
        listOf(
            "دینام را هر از چه مدت باید بازدید کرد؟",
            " هر هزار کیلومتر",
            " هر دو هزار کیلومتر",
            " هر سه هزار کیلومتر",
            " هر چهار هزار کیلومتر",
            "پاسخ صحیح : گزینه2"
        ),
        listOf(
            "کدام یک از موارد زیر صحیح نمی باشد ؟",
            "حداکثر سرعت در جاده های فرعی 75 کیلومتر در روز",
            " حداکثر سرعت در جاده های اصلی 85 کیلومتر در شب",
            " حداکثر سرعت در جاده های اصلی 95 کیلومتر در روز",
            " حداقل سرعت در در آزاد راه 70 کیلومتر و حداکثر 120 کیلومتر در ساعت برای سواری و وانت",
            "پاسخ صحیح : گزینه1"
        ),
        listOf(
            "در خیابان یک طرفه باید در کدام سمت اتومبیل را پارک کرد ؟",
            "چپ",
            "در خیابان یک طرفه نمی توان پارک کرد",
            " هر دو طرف پارک شود مانعی ندارد",
            " راست",
            "پاسخ صحیح : گزینه4"
        ),
        listOf(
            "خط ایست جز کدامیک از انواع خطوط زیر است؟",
            " زیگزاگ",
            " هاشور",
            " طولی",
            " عرضی",
            "پاسخ صحیح : گزینه4"
        ),
        listOf(
            "معمولاً در در محل برخورد راه فرعی به اصلی از چراغ … و در راه اصلی به فرعی چراغ … نصب می شود؟",
            " چشمک زن زرد - چشمک زن قرمز",
            " چشمک زن قرمز برای ایست - چراغ سبز",
            " چشمک زن قرمز - چشمک زن زرد",
            " چراغ قرمز - چراغ سبز",
            "پاسخ صحیح : گزینه3"
        ),
        listOf(
            "در شرایط جاده خیس و یخبندان در حال رانندگی هستید؛کدام مورد باید هنگام نزدیک شدن به پیچ تند رعایت شود؟",
            " هنگام رسیدن به پیچ با سرعت بیشتری برانید",
            " در تمامی مدت کلاج را پایین نگه دارید",
            " به آرامی ترمز دستی را بکشید",
            " قبل از رسیدن به پیچ از سرعت خود بکاهید و تاحد امکان با دنده سنگین حرکت کنید",
            "پاسخ صحیح : گزینه4"
        ),
        listOf(
            "فردی که نوشابه الکلی با مواد مخدر و داروهای خواب آور مصرف کرده در چه شرایطی می تواند رانندگی کند؟",
            " تا زمانی که آثار آن باقی است ، رانندگی ممنوع است.",
            " تا یک سال نباید رانندگی کند.",
            " در صورت شرایط اضطراری می تواند رانندگی کند.",
            " موارد 1 و 2",
            "پاسخ صحیح : گزینه1"
        ),
        listOf(
            "استفاده از چراغ های چشمک زن و رنگارنگ در وسایل نقلیه …",
            " تحت هر شرایطی حتی اخذ مجوز نیز ممنوع است.",
            " برای دید بیشتر اشیا و اشخاص مانعی ندارد.",
            " ممنوع است مگر با مجوزهای لازم از مراجع ذیصلاح",
            " مانعی ندارد.",
            "پاسخ صحیح : گزینه3"
        ),
        listOf(
            "عمق شیار تایر باید حداقل … میلی متر باشد و کم بودن عمق شیار تایر باعث …… می شود؟",
            " 1.5 میلی متر - افزایش مقدار اصطکاک میان تایر و سطح راه",
            " 1.5 میلی متر - سر خوردن خودرو به ویژه در سطح خیس یا مرطوب",
            " 1 میلی متر - کاهش اصطکاک تایر با سطح جاده",
            " 1 میلی متر - افزایش احتمال آسیب به تایر",
            "پاسخ صحیح : گزینه2"
        ),
        listOf(
            "روی یدک و هر نوع وسیله نقلیه ای که وسیله نقلیه دیگر را می کشد باید … بر روی وسیله نقلیه نصب تا سایر رانندگان آن را ببینند؟",
            " پرچم قرمز به ابعاد 50 سانتی متر",
            " چراغ الکتریکی با نور قرمز",
            " پرچم قرمز به ابعاد 100 سانتی متر",
            " پرچم سفید به ابعاد حداقل 50 سانتی متری",
            "پاسخ صحیح : گزینه4"

        ),
        listOf(
            "کدامیک از موارد زیر در خصوص رانندگی در شب صحیح است؟",
            " در شب زمان کمتری طول می کشد تا راننده موانع موجود را ببینید.",
            " میزان تصادفات در شب کاهش می یابد.",
            " محدوده دید راننده در شب کاهش می یابد.",
            " با افزایش سرعت در شب ها می توان کاهش دید را جبران کرد.",
            "پاسخ صحیح : گزینه3"
        ),
        listOf(
            "کدام یک از گزینه های زیر نادرست است ؟",
            " حداقل سرعت در آزاد راهها 70 کیلومتر در ساعت و حداکثر 120 کیلومتر برای سواری و وانت",
            " حداکثر سرعت در جاده های فرعی 75 کیلومتر در ساعت در روز",
            " حداکثر سرعت در جاده های اصلی 85 کیلومتر در ساعت در شب",
            " حداکثر سرعت در جاده های اصلی 95 کیلومتر در ساعت در روز",
            "پاسخ صحیح : گزینه3"

        )

    )
    private var currentIndex = 0
    private lateinit var textView1: TextView
    private lateinit var textView2: TextView
    private lateinit var textView3: TextView
    private lateinit var textView4: TextView
    private lateinit var textView5: TextView
    private lateinit var textView6: TextView
    private lateinit var textView19: TextView
    private lateinit var gestureDetector: GestureDetector
    private lateinit var ivChap: ImageView
    private lateinit var ivRast: ImageView


    @RequiresApi(Build.VERSION_CODES.M)
    @SuppressLint("MissingInflatedId")
    override fun onCreateView(
        inflater: LayoutInflater, container: ViewGroup?,
        savedInstanceState: Bundle?
    ): View? {
        val view = inflater.inflate(R.layout.fragment_my, container, false)

        textView1 = view.findViewById(R.id.textView1)
        textView2 = view.findViewById(R.id.textView2)
        textView3 = view.findViewById(R.id.textView3)
        textView4 = view.findViewById(R.id.textView4)
        textView5 = view.findViewById(R.id.textView5)
        textView6 = view.findViewById(R.id.textView6)
        textView19 = view.findViewById(R.id.textView19)
        ivChap = view.findViewById(R.id.ivChap)
        ivRast = view.findViewById(R.id.ivRast)

        gestureDetector = GestureDetector(requireContext(), MyGestureListener())
//        val view2: View = view.findViewById(R.id.view2)

        // اضافه کردن گوش دادن به حرکات کاربر برای تغییر محتوای TextViewها

//        view2.setOnTouchListener { _, event ->
//            gestureDetector.onTouchEvent(event)
//            true
//        }


//    if (ivRast.isClickable){
//        ivRast.setOnClickListener {
//            gestureDetector
//        }
//
//    }
//        if (ivChap.isClickable){
//
//            ivChap.setOnClickListener {
//                gestureDetector
//            }
//        }


//        val imageView4 = view.findViewById<ImageView>(R.id.imageView4)
//
//        val imageUrl =
//            "https://s.w.org/images/core/emoji/15.0.3/svg/2705.svg"
//        Glide.with(this)
//            .load(imageUrl)
//            .into(imageView4)
//
//        val idRast = view.findViewById<ImageView>(R.id.idRast)
//
//        val imageUrl2 =
//            "https://farsgraphic.com/wp-content/uploads/2016/05/%D8%A2%DB%8C%DA%A9%D9%88%D9%86-%D9%BE%DB%8C%DA%A9%D8%A7%D9%86-2.png"
//        Glide.with(this)
//            .load(imageUrl2)
//            .into(idRast)


        // نمایش محتوای اولیه
        updateContent()


        ivRast.setOnClickListener {
            currentIndex = (currentIndex + 1) % contentList.size
            val currentContent = contentList[currentIndex]
            textView1.alpha = 0f

            textView1.animate()
                .alpha(1f)
                .setDuration(1000)
                .start()
            textView2.alpha = 0f

            textView2.animate()
                .alpha(1f)
                .setDuration(1000)
                .start()
            textView3.alpha = 0f

            textView3.animate()
                .alpha(1f)
                .setDuration(1000)
                .start()
            textView4.alpha = 0f

            textView4.animate()
                .alpha(1f)
                .setDuration(1000)
                .start()
            textView5.alpha = 0f

            textView5.animate()
                .alpha(1f)
                .setDuration(1000)
                .start()
            textView6.alpha = 0f

            textView6.animate()
                .alpha(1f)
                .setDuration(1000)
                .start()

            if (currentIndex == 0) {
                textView19.text = "105"
            } else {
                textView19.text = "${currentIndex}"
                textView1.text = currentContent[0]
                textView2.text = currentContent[1]
                textView3.text = currentContent[2]
                textView4.text = currentContent[3]
                textView5.text = currentContent[4]
                textView6.text = currentContent[5]
            }



        }
        ivChap.setOnClickListener {
            currentIndex = (currentIndex - 1 + contentList.size) % contentList.size

            val currentContent = contentList[currentIndex]

            textView1.alpha = 0f

            textView1.animate()
                .alpha(1f)
                .setDuration(1000)
                .start()
            textView2.alpha = 0f

            textView2.animate()
                .alpha(1f)
                .setDuration(1000)
                .start()
            textView3.alpha = 0f

            textView3.animate()
                .alpha(1f)
                .setDuration(1000)
                .start()
            textView4.alpha = 0f

            textView4.animate()
                .alpha(1f)
                .setDuration(1000)
                .start()
            textView5.alpha = 0f

            textView5.animate()
                .alpha(1f)
                .setDuration(1000)
                .start()
            textView6.alpha = 0f

            textView6.animate()
                .alpha(1f)
                .setDuration(1000)
                .start()

            if (currentIndex == 0) {
                textView19.text = "105"
            } else {
                textView19.text = "${currentIndex}"
                textView1.text = currentContent[0]
                textView2.text = currentContent[1]
                textView3.text = currentContent[2]
                textView4.text = currentContent[3]
                textView5.text = currentContent[4]
                textView6.text = currentContent[5]
            }



        }

        return view
    }


    private inner class MyGestureListener : GestureDetector.SimpleOnGestureListener() {
        override fun onFling(
            e1: MotionEvent?,
            e2: MotionEvent,
            velocityX: Float,
            velocityY: Float
        ): Boolean {
            val diffX = e2.x - (e1?.x ?: 0f)


            // اگر حرکت از چپ به راست بود، به محتوای بعدی برو
            if (diffX > 0) {

                currentIndex = (currentIndex - 1 + contentList.size) % contentList.size

                if (currentIndex == 0) {
                    textView19.text = "105"
                } else {
                    textView19.text = "${currentIndex}"
                }


            }
            // اگر حرکت از راست به چپ بود، به محتوای قبلی برو
            else {

                currentIndex = (currentIndex + 1) % contentList.size

                if (currentIndex == 0) {
                    textView19.text = "105"
                } else {
                    textView19.text = "${currentIndex}"
                }


            }
            updateContent()
            return true
        }

    }

    private fun updateContent() {
        val currentContent = contentList[currentIndex]

        textView1.alpha = 0f

        textView1.animate()
            .alpha(1f)
            .setDuration(1000)
            .start()
        textView2.alpha = 0f

        textView2.animate()
            .alpha(1f)
            .setDuration(1000)
            .start()
        textView3.alpha = 0f

        textView3.animate()
            .alpha(1f)
            .setDuration(1000)
            .start()
        textView4.alpha = 0f

        textView4.animate()
            .alpha(1f)
            .setDuration(1000)
            .start()
        textView5.alpha = 0f

        textView5.animate()
            .alpha(1f)
            .setDuration(1000)
            .start()
        textView6.alpha = 0f

        textView6.animate()
            .alpha(1f)
            .setDuration(1000)
            .start()


        textView1.text = currentContent[0]
        textView2.text = currentContent[1]
        textView3.text = currentContent[2]
        textView4.text = currentContent[3]
        textView5.text = currentContent[4]
        textView6.text = currentContent[5]

    }

}




